Neurotech-Hub/arduino-esp32-hub/boards.txt
##############################################################
# FED4 by Kravtiz Lab

fed4.name=FED4 by Kravitz Lab

fed4.bootloader.tool=esptool_py
fed4.bootloader.tool.default=esptool_py

fed4.upload.tool=esptool_py
fed4.upload.tool.default=esptool_py
fed4.upload.tool.network=esp_ota

fed4.upload.maximum_size=1310720
fed4.upload.maximum_data_size=327680
fed4.upload.flags=
fed4.upload.extra_flags=
fed4.upload.use_1200bps_touch=false
fed4.upload.wait_for_upload_port=false

fed4.serial.disableDTR=false
fed4.serial.disableRTS=false

fed4.build.tarch=xtensa
fed4.build.bootloader_addr=0x0
fed4.build.target=esp32s3
fed4.build.mcu=esp32s3
fed4.build.core=esp32
fed4.build.variant=fed4
fed4.build.board=FED4

fed4.build.usb_mode=1
fed4.build.cdc_on_boot=0
fed4.build.msc_on_boot=0
fed4.build.dfu_on_boot=0
fed4.build.f_cpu=240000000L
fed4.build.flash_size=4MB
fed4.build.flash_freq=80m
fed4.build.flash_mode=dio
fed4.build.boot=qio
fed4.build.boot_freq=80m
fed4.build.partitions=default
fed4.build.defines=
fed4.build.loop_core=
fed4.build.event_core=
fed4.build.psram_type=qspi
fed4.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
fed4.menu.JTAGAdapter.default=Disabled
fed4.menu.JTAGAdapter.default.build.copy_jtag_files=0
fed4.menu.JTAGAdapter.builtin=Integrated USB JTAG
fed4.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
fed4.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
fed4.menu.JTAGAdapter.external=FTDI Adapter
fed4.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
fed4.menu.JTAGAdapter.external.build.copy_jtag_files=1
fed4.menu.JTAGAdapter.bridge=ESP USB Bridge
fed4.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
fed4.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

fed4.menu.PSRAM.disabled=Disabled
fed4.menu.PSRAM.disabled.build.defines=
fed4.menu.PSRAM.disabled.build.psram_type=qspi
fed4.menu.PSRAM.enabled=QSPI PSRAM
fed4.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
fed4.menu.PSRAM.enabled.build.psram_type=qspi
fed4.menu.PSRAM.opi=OPI PSRAM
fed4.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
fed4.menu.PSRAM.opi.build.psram_type=opi

fed4.menu.FlashMode.qio=QIO 80MHz
fed4.menu.FlashMode.qio.build.flash_mode=dio
fed4.menu.FlashMode.qio.build.boot=qio
fed4.menu.FlashMode.qio.build.boot_freq=80m
fed4.menu.FlashMode.qio.build.flash_freq=80m
fed4.menu.FlashMode.qio120=QIO 120MHz
fed4.menu.FlashMode.qio120.build.flash_mode=dio
fed4.menu.FlashMode.qio120.build.boot=qio
fed4.menu.FlashMode.qio120.build.boot_freq=120m
fed4.menu.FlashMode.qio120.build.flash_freq=80m
fed4.menu.FlashMode.dio=DIO 80MHz
fed4.menu.FlashMode.dio.build.flash_mode=dio
fed4.menu.FlashMode.dio.build.boot=dio
fed4.menu.FlashMode.dio.build.boot_freq=80m
fed4.menu.FlashMode.dio.build.flash_freq=80m
fed4.menu.FlashMode.opi=OPI 80MHz
fed4.menu.FlashMode.opi.build.flash_mode=dout
fed4.menu.FlashMode.opi.build.boot=opi
fed4.menu.FlashMode.opi.build.boot_freq=80m
fed4.menu.FlashMode.opi.build.flash_freq=80m

fed4.menu.FlashSize.4M=4MB (32Mb)
fed4.menu.FlashSize.4M.build.flash_size=4MB
fed4.menu.FlashSize.8M=8MB (64Mb)
fed4.menu.FlashSize.8M.build.flash_size=8MB
fed4.menu.FlashSize.16M=16MB (128Mb)
fed4.menu.FlashSize.16M.build.flash_size=16MB
fed4.menu.FlashSize.32M=32MB (256Mb)
fed4.menu.FlashSize.32M.build.flash_size=32MB

fed4.menu.LoopCore.1=Core 1
fed4.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
fed4.menu.LoopCore.0=Core 0
fed4.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

fed4.menu.EventsCore.1=Core 1
fed4.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
fed4.menu.EventsCore.0=Core 0
fed4.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

fed4.menu.USBMode.hwcdc=Hardware CDC and JTAG
fed4.menu.USBMode.hwcdc.build.usb_mode=1
fed4.menu.USBMode.default=USB-OTG (TinyUSB)
fed4.menu.USBMode.default.build.usb_mode=0

fed4.menu.CDCOnBoot.default=Disabled
fed4.menu.CDCOnBoot.default.build.cdc_on_boot=0
fed4.menu.CDCOnBoot.cdc=Enabled
fed4.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

fed4.menu.MSCOnBoot.default=Disabled
fed4.menu.MSCOnBoot.default.build.msc_on_boot=0
fed4.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
fed4.menu.MSCOnBoot.msc.build.msc_on_boot=1

fed4.menu.DFUOnBoot.default=Disabled
fed4.menu.DFUOnBoot.default.build.dfu_on_boot=0
fed4.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
fed4.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

fed4.menu.UploadMode.default=UART0 / Hardware CDC
fed4.menu.UploadMode.default.upload.use_1200bps_touch=false
fed4.menu.UploadMode.default.upload.wait_for_upload_port=false
fed4.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
fed4.menu.UploadMode.cdc.upload.use_1200bps_touch=true
fed4.menu.UploadMode.cdc.upload.wait_for_upload_port=true

fed4.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
fed4.menu.PartitionScheme.default.build.partitions=default
fed4.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
fed4.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
fed4.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
fed4.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
fed4.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
fed4.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
fed4.menu.PartitionScheme.minimal.build.partitions=minimal
fed4.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
fed4.menu.PartitionScheme.no_fs.build.partitions=no_fs
fed4.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
fed4.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
fed4.menu.PartitionScheme.no_ota.build.partitions=no_ota
fed4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
fed4.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
fed4.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
fed4.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
fed4.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
fed4.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
fed4.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
fed4.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
fed4.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
fed4.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
fed4.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
fed4.menu.PartitionScheme.huge_app.build.partitions=huge_app
fed4.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
fed4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
fed4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
fed4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
fed4.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
fed4.menu.PartitionScheme.fatflash.build.partitions=ffat
fed4.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
fed4.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
fed4.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
fed4.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
fed4.menu.PartitionScheme.rainmaker=RainMaker 4MB
fed4.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
fed4.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
fed4.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
fed4.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
fed4.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
fed4.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
fed4.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
fed4.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
fed4.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
fed4.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
fed4.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
fed4.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
fed4.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
fed4.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
fed4.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
fed4.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
fed4.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
fed4.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
fed4.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
fed4.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
fed4.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
fed4.menu.PartitionScheme.custom=Custom
fed4.menu.PartitionScheme.custom.build.partitions=
fed4.menu.PartitionScheme.custom.upload.maximum_size=16777216

fed4.menu.CPUFreq.240=240MHz (WiFi)
fed4.menu.CPUFreq.240.build.f_cpu=240000000L
fed4.menu.CPUFreq.160=160MHz (WiFi)
fed4.menu.CPUFreq.160.build.f_cpu=160000000L
fed4.menu.CPUFreq.80=80MHz (WiFi)
fed4.menu.CPUFreq.80.build.f_cpu=80000000L
fed4.menu.CPUFreq.40=40MHz
fed4.menu.CPUFreq.40.build.f_cpu=40000000L
fed4.menu.CPUFreq.20=20MHz
fed4.menu.CPUFreq.20.build.f_cpu=20000000L
fed4.menu.CPUFreq.10=10MHz
fed4.menu.CPUFreq.10.build.f_cpu=10000000L

fed4.menu.UploadSpeed.921600=921600
fed4.menu.UploadSpeed.921600.upload.speed=921600
fed4.menu.UploadSpeed.115200=115200
fed4.menu.UploadSpeed.115200.upload.speed=115200
fed4.menu.UploadSpeed.256000.windows=256000
fed4.menu.UploadSpeed.256000.upload.speed=256000
fed4.menu.UploadSpeed.230400.windows.upload.speed=256000
fed4.menu.UploadSpeed.230400=230400
fed4.menu.UploadSpeed.230400.upload.speed=230400
fed4.menu.UploadSpeed.460800.linux=460800
fed4.menu.UploadSpeed.460800.macosx=460800
fed4.menu.UploadSpeed.460800.upload.speed=460800
fed4.menu.UploadSpeed.512000.windows=512000
fed4.menu.UploadSpeed.512000.upload.speed=512000

fed4.menu.DebugLevel.none=None
fed4.menu.DebugLevel.none.build.code_debug=0
fed4.menu.DebugLevel.error=Error
fed4.menu.DebugLevel.error.build.code_debug=1
fed4.menu.DebugLevel.warn=Warn
fed4.menu.DebugLevel.warn.build.code_debug=2
fed4.menu.DebugLevel.info=Info
fed4.menu.DebugLevel.info.build.code_debug=3
fed4.menu.DebugLevel.debug=Debug
fed4.menu.DebugLevel.debug.build.code_debug=4
fed4.menu.DebugLevel.verbose=Verbose
fed4.menu.DebugLevel.verbose.build.code_debug=5

fed4.menu.EraseFlash.none=Disabled
fed4.menu.EraseFlash.none.upload.erase_cmd=
fed4.menu.EraseFlash.all=Enabled
fed4.menu.EraseFlash.all.upload.erase_cmd=-e

fed4.menu.ZigbeeMode.default=Disabled
fed4.menu.ZigbeeMode.default.build.zigbee_mode=
fed4.menu.ZigbeeMode.default.build.zigbee_libs=
fed4.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
fed4.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
fed4.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

